Revit 2025 API
CutMarkSymbol Enumeration
 The available shapes for the cut mark symbol.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CutMarkSymbol
Public Enumeration CutMarkSymbol
public enum class CutMarkSymbol
type CutMarkSymbol
Members
Member name | Value | Description
None | 0 |  Cut mark shape is linear.
Zigzag | 1 |  Cut mark shape is zigzagged.
Curve | 2 |  Cut mark shape is curved.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace